In [1]:
#mean calculation in dataframe

In [2]:
import pandas as pd

In [3]:
data=pd.read_csv("D:\machine_learning\mean.csv")

In [4]:
data

   A1  A2  A3
0  12  78  98
1  78  99  67
2  45  22  23

In [5]:
mean=data.mean(axis=1)
mean

0    62.666667
1    81.333333
2    30.000000
dtype: float64

In [6]:
data["mean"]=mean

In [6]:
data

   A1  A2  A3       mean
0  12  78  98  62.666667
1  78  99  67  81.333333
2  45  22  23  30.000000